/* =====================================================================
//! @param		「Human」クラスのソースファイル
//! @create		樋口　裕太
//! @date		17/04/07
===================================================================== */

// ヘッダファイルのインクルード
#include "Human.h"

// 名前空間
USING_NS_CC;

// メンバ関数の定義

// 初期設定
bool Human::init()
{
	if (!Layer::init())
	{
		return false;
	}

	// メンバの初期設定
	m_fullPoint = 0;

	return true;
}

/* =====================================================================
//! 内　容		満腹度を設定
//! 引　数		食材のポイント（int）
//! 戻り値		なし
===================================================================== */
void Human::SetFullPoint(int point)
{
	m_fullPoint += point;
}

/* =====================================================================
//! 内　容		満腹度を取得
//! 引　数		なし
//! 戻り値		満腹度（int）
===================================================================== */
int Human::GetFullPoint()
{
	return m_fullPoint;
}
